---
kind: property
id: P:Autodesk.Revit.DB.LayerModifier.ModifierType
source: html/2b8b1b31-32e5-29e4-034e-ebd443977230.htm
---
# Autodesk.Revit.DB.LayerModifier.ModifierType Property

The modifier type of LayerModifier.

## Syntax (C#)
```csharp
public ModifierType ModifierType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration